#Создание персонажа

hero = {"Имя":"",
        "Сила":"",
        "Ловкость":"",
        "Выносливость":"",
        "Здоровье (макс.)":"",
        "Здоровье":""}

hero["Имя"] = input("Введите имя Вашего персонажа: ")
choice = 0
#while choice != 1 or choice !=2 or choice !=3:
choice = int(input("Выберите стартовые параметры Вашего персонажа:\n"
      "1 - Сила: 14, Ловкость 12, Выносливость 8\n"
      "2 - Сила: 12, Ловкость 12, Выносливость 10\n"
      "3 - Сила: 10, Ловкость 12, Выносливость 12\n"))
if choice == 1:
    hero["Сила", "Ловкость", "Выносливость"] = 14, 12, 8
elif choice == 2:
    hero["Сила", "Ловкость", "Выносливость"] = 12, 12, 10
else:
    hero["Сила", "Ловкость", "Выносливость"] = 10, 12, 12
hero["Здоровье (макс.)"] = (hero["Сила"] - 10)/2 + (hero["Выносливость"] - 10)*10
hero["Здоровье"] = hero["Здоровье (макс.)"]
save_hero = open("save.txt", "w")
save_hero.write(hero)
save_hero.close()

if __name__ == __main__:
    main()
